#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.database_password: Refreshing state... [id=none]
random_password.staging_db_password: Refreshing state... [id=none]
google_project_service.run: Refreshing state... [id=venture-capitol/run.googleapis.com]
google_project_service.sql: Refreshing state... [id=venture-capitol/sqladmin.googleapis.com]
google_project_service.iam: Refreshing state... [id=venture-capitol/iam.googleapis.com]
google_project_service.secretmanager: Refreshing state... [id=venture-capitol/secretmanager.googleapis.com]
google_secret_manager_secret.staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/staging_db_connection_string]
google_service_account.backend_sa: Refreshing state... [id=projects/venture-capitol/serviceAccounts/backend-sa@venture-capitol.iam.gserviceaccount.com]
google_sql_database_instance.vc_db: Refreshing state... [id=vc-backend-database]
google_secret_manager_secret.db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string]
google_secret_manager_secret_iam_binding.db_connection_string_access: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string/roles/secretmanager.secretAccessor]
google_project_iam_binding.service_permissions["run.admin"]: Refreshing state... [id=venture-capitol/roles/run.admin]
google_project_iam_binding.service_permissions["cloudsql.client"]: Refreshing state... [id=venture-capitol/roles/cloudsql.client]
google_sql_user.staging_database_user: Refreshing state... [id=staging_backend_user//vc-backend-database]
google_secret_manager_secret_version.staging_db_connection_string: Refreshing state... [id=projects/122736358705/secrets/staging_db_connection_string/versions/1]
google_sql_database.staging_backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/staging_backend]
google_sql_database.backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/backend]
google_sql_user.database_user: Refreshing state... [id=backend_user//vc-backend-database]
google_secret_manager_secret_version.db_connection_string_data: Refreshing state... [id=projects/122736358705/secrets/db_connection_string/versions/1]
google_cloud_run_service.staging_backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging]
google_cloud_run_service.backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/venture-capitol/locations/europe-west1/services/vc-backend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_cloud_run_service.staging_backend has changed
  ~ resource "google_cloud_run_service" "staging_backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging"
        name                       = "vc-backend-staging"
      + project                    = "venture-capitol"
      + status                     = [
          + {
              + conditions                   = [
                  + {
                      + message = "spec.template.spec.container.env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/122736358705/secrets/staging_db_connection_string/versions/1 for Revision service account backend-sa@venture-capitol.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level."
                      + reason  = ""
                      + status  = "False"
                      + type    = "Ready"
                    },
                  + {
                      + message = "spec.template.spec.container.env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/122736358705/secrets/staging_db_connection_string/versions/1 for Revision service account backend-sa@venture-capitol.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level."
                      + reason  = ""
                      + status  = "False"
                      + type    = "ConfigurationsReady"
                    },
                  + {
                      + message = "spec.template.spec.container.env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/122736358705/secrets/staging_db_connection_string/versions/1 for Revision service account backend-sa@venture-capitol.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level."
                      + reason  = ""
                      + status  = "False"
                      + type    = "RoutesReady"
                    },
                ]
              + latest_created_revision_name = "vc-backend-staging-8dm8b"
              + latest_ready_revision_name   = ""
              + observed_generation          = 1
              + url                          = ""
            },
        ]
        # (2 unchanged attributes hidden)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/ingress"       = "all"
              + "serving.knative.dev/creator"      = "vc-cicd@venture-capitol.iam.gserviceaccount.com"
              + "serving.knative.dev/lastModifier" = "vc-cicd@venture-capitol.iam.gserviceaccount.com"
            }
          + generation       = 1
          + labels           = {
              + "cloud.googleapis.com/location" = "europe-west1"
            }
          + namespace        = "venture-capitol"
          + resource_version = "AAXTDwLz6SA"
          + self_link        = "/apis/serving.knative.dev/v1/namespaces/122736358705/services/vc-backend-staging"
          + uid              = "72a4e6dd-e054-4083-bd8e-b8d8c66dcc76"
        }

      ~ template {
          ~ metadata {
              + labels      = {}
                # (2 unchanged attributes hidden)
            }

          ~ spec {
              ~ container_concurrency = 0 -> 80
              ~ timeout_seconds       = 0 -> 300
                # (1 unchanged attribute hidden)

              ~ containers {
                  + args    = []
                  + command = []
                    # (1 unchanged attribute hidden)


                  + ports {
                      + container_port = 8080
                      + name           = "http1"
                    }

                  + resources {
                      + limits   = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                      + requests = {}
                    }
                    # (1 unchanged block hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # google_secret_manager_secret.staging_db_connection_string has changed
  ~ resource "google_secret_manager_secret" "staging_db_connection_string" {
        id          = "projects/venture-capitol/secrets/staging_db_connection_string"
      + labels      = {}
        name        = "projects/122736358705/secrets/staging_db_connection_string"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.backend will be updated in-place
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend"
        name                       = "vc-backend"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:0f5c6c" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:65be10"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.staging_backend is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "staging_backend" {
      ~ id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging" -> (known after apply)
        name                       = "vc-backend-staging"
      ~ project                    = "venture-capitol" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "spec.template.spec.container.env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/122736358705/secrets/staging_db_connection_string/versions/1 for Revision service account backend-sa@venture-capitol.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level."
                      - reason  = ""
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = "spec.template.spec.container.env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/122736358705/secrets/staging_db_connection_string/versions/1 for Revision service account backend-sa@venture-capitol.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level."
                      - reason  = ""
                      - status  = "False"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = "spec.template.spec.container.env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/122736358705/secrets/staging_db_connection_string/versions/1 for Revision service account backend-sa@venture-capitol.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level."
                      - reason  = ""
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "vc-backend-staging-8dm8b"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - url                          = ""
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"       = "all"
              - "serving.knative.dev/creator"      = "vc-cicd@venture-capitol.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier" = "vc-cicd@venture-capitol.iam.gserviceaccount.com"
            } -> (known after apply)
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {
              - "cloud.googleapis.com/location" = "europe-west1"
            } -> (known after apply)
          ~ namespace        = "venture-capitol" -> (known after apply)
          ~ resource_version = "AAXTDwLz6SA" -> (known after apply)
          ~ self_link        = "/apis/serving.knative.dev/v1/namespaces/122736358705/services/vc-backend-staging" -> (known after apply)
          ~ uid              = "72a4e6dd-e054-4083-bd8e-b8d8c66dcc76" -> (known after apply)
        }

      ~ template {
          ~ metadata {
              ~ generation       = 0 -> (known after apply)
              - labels           = {} -> null
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:6ee003" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:65be10"


                  ~ ports {
                      ~ container_port = 8080 -> (known after apply)
                      ~ name           = "http1" -> (known after apply)
                      + protocol       = (known after apply)
                    }

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> (known after apply)
                      ~ requests = {} -> (known after apply)
                    }
                    # (1 unchanged block hidden)
                }
            }
        }

      ~ traffic {
            # (2 unchanged attributes hidden)
        }
    }

  # google_secret_manager_secret_iam_binding.staging_db_connection_string will be created
  + resource "google_secret_manager_secret_iam_binding" "staging_db_connection_string" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + members   = [
          + "serviceAccount:backend-sa@venture-capitol.iam.gserviceaccount.com",
        ]
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "projects/venture-capitol/secrets/staging_db_connection_string"
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>